salara1960/stm32f401_project/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  ******************************************************************************
  ******************************************************************************
  */

/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

//arm-none-eabi-objcopy -O ihex "${BuildArtifactFileBaseName}.elf" "${BuildArtifactFileBaseName}.hex" && arm-none-eabi-objcopy -O binary "${BuildArtifactFileBaseName}.elf" "${BuildArtifactFileBaseName}.bin" && ls -la | grep "${BuildArtifactFileBaseName}.*"

#include "stm32f4xx_hal_rtc.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
I2C_HandleTypeDef hi2c1;
I2C_HandleTypeDef hi2c2;
DMA_HandleTypeDef hdma_i2c2_tx;

RTC_HandleTypeDef hrtc;

SPI_HandleTypeDef hspi1;
DMA_HandleTypeDef hdma_spi1_tx;
DMA_HandleTypeDef hdma_spi1_rx;

TIM_HandleTypeDef htim2;
TIM_HandleTypeDef htim3;

UART_HandleTypeDef huart1;
UART_HandleTypeDef huart2;
UART_HandleTypeDef huart6;
DMA_HandleTypeDef hdma_usart1_tx;
DMA_HandleTypeDef hdma_usart1_rx;
DMA_HandleTypeDef hdma_usart2_tx;
DMA_HandleTypeDef hdma_usart6_tx;

/* USER CODE BEGIN PV */

//const char *version = "0.1 (25.04.2021)";
//const char *version = "0.2 (26.04.2021)";
//const char *version = "0.3 (27.04.2021)";
//const char *version = "0.4 (28.04.2021)";
//const char *version = "0.5 (28.04.2021)";//support KBD done !
//const char *version = "0.6 (01.05.2021)";// add DFPlayer and connect to ARM via USART6(9600 8N1)
//const char *version = "0.7 (02.05.2021)";// add library for DFPlayer
//const char *version = "0.8 (03.05.2021)";// major changes for DFPlayer support (add recv. in interrupt mode)
//const char *version = "0.9 (05.05.2021)";//add support folders on storage
//const char *version = "1.0 (06.05.2021)";
//const char *version = "1.1 (07.05.2021)";// add infrared control module (TL1838)
//const char *version = "1.2 (08.05.2021)";// add BLE audio module (uart) - first step (host version - listen client)
//const char *version = "1.3 (09.05.2021)";// minor changes for BLE audio module support - second step
//const char *version = "1.4 (10.05.2021)";// major changes for BLE audio module : support 'income_opid:' message from ble_client's
const char *version = "1.5 (11.05.2021)";// add ble_connect_enable_pin



static evt_t evt_fifo[MAX_FIFO_SIZE] = {msg_empty};
uint8_t rd_evt_adr = 0;
uint8_t wr_evt_adr = 0;
uint8_t wr_evt_err = 0;
uint8_t cnt_evt = 0;
uint8_t max_evt = 0;
UART_HandleTypeDef *portLOG = &huart1;

//1620036392;//1619997553;//1619963555;//1619617520;//1619599870;//1619513155;//1619473366;//1619375396;//1619335999;
volatile time_t epoch = 1620725850;//1620673738;//1620557655;//1620467295;//1620406195;//1620329368;//1620246336;//1620214632;//1620063356;
uint8_t tZone = 2;
volatile uint32_t cnt_err = 0;
volatile uint8_t restart_flag = 0;
volatile static uint32_t secCounter = 0;
volatile static uint32_t HalfSecCounter = 0;
volatile static bool setDate = false;
static const char *_extDate = "epoch=";
static const char *_restart = "rst";
volatile uint32_t extDate = 0;
static char RxBuf[MAX_UART_BUF];
volatile uint8_t rx_uk;
volatile uint8_t uRxByte = 0;
uint8_t uartRdy = 1;
uint8_t devError = 0;
char stx[128] = {0};

I2C_HandleTypeDef *portOLED = &hi2c2;
char buf[128] = {0};
uint8_t screenON = 0;

SPI_HandleTypeDef *portFLASH = &hspi1;
uint32_t spi_cnt = 0;
uint8_t spiRdy = 1;

bool kbdPresent = false;
bool kbdInitOk = false;
int16_t kbdAddr = 0;
bool kbdEnable = false;
#ifdef SET_KBD
	I2C_HandleTypeDef *portKBD = &hi2c1;
	uint8_t cntKBD = 0;
	volatile uint16_t kbdCode = 0;
	volatile uint32_t kbdCnt = 0;
	uint8_t kbdRdy = 1;
#endif

#ifdef SET_DFPLAYER
	UART_HandleTypeDef *portDFP = &huart6;
	int eqClass = EQ_Normal;
	int dfp_volume = DFPLAYER_MAX_VOLUME;
	uint8_t dfpCmd = 0;
	//
	static char dfp_RxBuf[MAX_UART_BUF];
	volatile uint8_t dfp_rx_uk;
	volatile uint8_t dfp_uRxByte = 0;
	uint8_t dfpRdy = 1;
	//
	uint8_t dfp_ACK[64] = {0};
	uint8_t dfp_ACK_len = 0;
	bool dfp_Begin = false;
	bool dfp_End = false;
	uint32_t dfp_tmr_next = 0;
	int8_t dfp_folder = 0;//folder number
	int8_t dfp_folders = 0;//total folders on storage
	uint16_t dfp_track = 0;//track number on storage
	uint16_t dfp_folder_tracks = 0;//total tracks in folder
	uint16_t dfp_folder_trk = 0;//track number in folder
	uint16_t dfp_all_tracks = 0;
	bool dfp_pause = false;
	//
	folder_t *all_folder = NULL;
	//
	bool newDir = false;
	uint32_t tmr_newDir = 0;
	int8_t uk_newDir = 0;
	bool inv_newDir = false;

#endif

#ifdef SET_IRED

	const one_key_t keyAll[MAX_IRED_KEY] = {
			{"irCH-",   0xe318261b},
			{"irCH",    0x00511dbb},
			{"irCH+",   0xee886d7f},
			{"irLEFT",  0x52a3d41f},
			{"irRIGHT", 0xd7e84b1b},
			{"irSP",    0x20fe4dbb},
			{"ir-",     0xf076c13b},
			{"ir+",     0xa3c8eddb},
			{"irEQ",    0xe5cfbd7f},
			{"ir100+",  0x97483bfb},
			{"ir200+",  0xf0c41643},
			{"ir0",     0xc101e57b},
			{"ir1",     0x9716be3f},
			{"ir2",     0x3d9ae3f7},
			{"ir3",     0x6182021b},
			{"ir4",     0x8c22657b},
			{"ir5",     0x488f3cbb},
			{"ir6",     0x0449e79f},
			{"ir7",     0x32c6fdf7},
			{"ir8",     0x1bc0157b},
			{"ir9",     0x3ec3fc1b}
	};

	TIM_HandleTypeDef *portIRED = &htim3; // таймер для приёма

#endif

#ifdef SET_BLE
	const char *TAG_BLE = "BLE";
	UART_HandleTypeDef *portBLE = &huart2;
	static char ble_RxBuf[MAX_BLE_BUF] = {0};
	volatile uint8_t ble_rx_uk;
	volatile uint8_t ble_uRxByte = 0;
	static char BleBuf[MAX_BLE_BUF] = {0};
	ble_client_t ble_client;
	char ble_str[32] = {0};
	uint8_t ble_withDMA = 1;
	char bleTmp[MAX_BLE_BUF] = {0};
	char ble_TxBuf[MAX_BLE_BUF] = {0};
	int ble_status = bleERR;
	uint32_t tmr_ble_con = 0;
	uint16_t ble_CtlCode = 0;
	uint8_t ble_CtlInd = 0;
#endif

/* USER CODE END PV */

