salara1960/stm32f401_project/Core/Src/main.c
/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_I2C1_Init(void);
static void MX_SPI1_Init(void);
static void MX_I2C2_Init(void);
static void MX_RTC_Init(void);
static void MX_TIM3_Init(void);
static void MX_USART6_UART_Init(void);
static void MX_TIM2_Init(void);
static void MX_USART2_UART_Init(void);
/* USER CODE BEGIN PFP */

uint32_t get_tmr10(uint32_t ms);
bool check_tmr10(uint32_t ms);
uint32_t get_tmr(uint32_t sec);
bool check_tmr(uint32_t sec);
//void floatPart(float val, s_float_t *part);
void errLedOn(const char *from);
void set_Date(time_t epoch);
int sec_to_str_time(uint32_t sec, char *stx);
uint8_t Report(const char *tag, bool addTime, const char *fmt, ...);


/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

//-------------------------------------------------------------------------------------------
void putMsg(evt_t evt)
{

	if (cnt_evt > (MAX_FIFO_SIZE - 5)) return;

	HAL_NVIC_DisableIRQ(EXTI1_IRQn);
	HAL_NVIC_DisableIRQ(TIM3_IRQn);
#ifdef SET_DFPLAYER
	HAL_NVIC_DisableIRQ(USART6_IRQn);
#endif
#ifdef SET_BLE
	HAL_NVIC_DisableIRQ(USART2_IRQn);
#endif


	if (cnt_evt >= MAX_FIFO_SIZE) {
		wr_evt_err++;
	} else {
		evt_fifo[wr_evt_adr] = evt;
		cnt_evt++;
		if (wr_evt_adr < (MAX_FIFO_SIZE - 1) ) {
			wr_evt_adr++;
		} else  {
			wr_evt_adr = 0;
		}
		wr_evt_err = 0;
		if (cnt_evt > max_evt) max_evt = cnt_evt;
	}

	if (wr_evt_err) devError |= devFifo;
		       else devError &= ~devFifo;

#ifdef SET_BLE
	HAL_NVIC_EnableIRQ(USART2_IRQn);
#endif
#ifdef SET_DFPLAYER
	HAL_NVIC_EnableIRQ(USART6_IRQn);
#endif
	HAL_NVIC_EnableIRQ(TIM3_IRQn);
	HAL_NVIC_EnableIRQ(EXTI1_IRQn);

}
//-------------------------------------------------------------------------------------------
evt_t getMsg()
{
evt_t ret = msg_empty;

	HAL_NVIC_DisableIRQ(EXTI1_IRQn);
	HAL_NVIC_DisableIRQ(TIM3_IRQn);
#ifdef SET_DFPLAYER
	HAL_NVIC_DisableIRQ(USART6_IRQn);
#endif
#ifdef SET_BLE
	HAL_NVIC_DisableIRQ(USART2_IRQn);
#endif


	if (cnt_evt) {
		ret = evt_fifo[rd_evt_adr];
		if (cnt_evt) cnt_evt--;
		if (rd_evt_adr < (MAX_FIFO_SIZE - 1) ) {
			rd_evt_adr++;
		} else {
			rd_evt_adr = 0;
		}
	}

#ifdef SET_BLE
	HAL_NVIC_EnableIRQ(USART2_IRQn);
#endif
#ifdef SET_DFPLAYER
	HAL_NVIC_EnableIRQ(USART6_IRQn);
#endif
	HAL_NVIC_EnableIRQ(TIM3_IRQn);
	HAL_NVIC_EnableIRQ(EXTI1_IRQn);

	return ret;
}
//-------------------------------------------------------------------------------------------

//*******************************************************************************************
#ifdef SET_BLE
//-------------------------------------------------------------------------------------------
void bleWrite(char *str, bool prn)
{
	if (ble_withDMA) {
		if (HAL_UART_Transmit_DMA(portBLE, (uint8_t *)str, strlen(str)) != HAL_OK) devError |= devBLE;
		/*
		while (HAL_UART_GetState(portBLE) != HAL_UART_STATE_READY) {
			if (HAL_UART_GetState(portBLE) == HAL_UART_STATE_BUSY_RX) break;
			//HAL_Delay(1);
		}
		*/
	} else {
		if (HAL_UART_Transmit(portBLE, (uint8_t *)str, strlen(str), 1000) != HAL_OK) devError |= devBLE;
	}

	if (prn) Report(TAG_BLE, true, "%s\n", str);

}
//-------------------------------------------------------------------------------------------
void parseCtl(uint16_t ccode)
{
	evt_t ev = msg_none;
	switch (ccode) {
		case bleNextTrk://0x4bcb:// next track
			ev = msg_fwd;
		break;
		case bleBackTrk://0x4ccc:// back track
			ev = msg_back;
		break;
		case blePlay://0x46c6: //play
		case blePause://0x44c4: //pause
			ev = msg_rplay;
		break;
	}

	if (ev != msg_none) putMsg(ev);
}
//-------------------------------------------------------------------------------------------
void blePin()
{
	BLE_CONN_DOWN();
	uint32_t start = HAL_GetTick();
	HAL_Delay(9);
	BLE_CONN_UP();
	Report(TAG_BLE, true, "\t*** BLE_CONN_PIN UP (%lu) ***\n", HAL_GetTick() - start);
}
//-------------------------------------------------------------------------------------------
#endif
//*******************************************************************************************

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{
  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_USART1_UART_Init();
  MX_I2C1_Init();
  MX_SPI1_Init();
  MX_I2C2_Init();
  MX_RTC_Init();
  MX_TIM3_Init();
  MX_USART6_UART_Init();
  MX_TIM2_Init();
  MX_USART2_UART_Init();
  /* USER CODE BEGIN 2 */

  	HAL_GPIO_WritePin(LED_GPIO_Port, LED_Pin, GPIO_PIN_SET);
  	HAL_GPIO_WritePin(LED_ERROR_GPIO_Port, LED_ERROR_Pin, GPIO_PIN_SET);
    HAL_Delay(250);
    HAL_GPIO_WritePin(LED_ERROR_GPIO_Port, LED_ERROR_Pin, GPIO_PIN_RESET);
    HAL_GPIO_WritePin(LED_GPIO_Port, LED_Pin, GPIO_PIN_RESET);



    //"start" rx_interrupt
    HAL_UART_Receive_IT(portLOG, (uint8_t *)&uRxByte, 1);
#ifdef SET_DFPLAYER
    HAL_UART_Receive_IT(portDFP, (uint8_t *)&dfp_uRxByte, 1);
#endif
#ifdef SET_BLE
    HAL_UART_Receive_IT(portBLE, (uint8_t *)&ble_uRxByte, 1);

    BLE_CONN_DOWN();
#endif

    // start timer3 in interrupt mode
    HAL_TIM_Base_Start_IT(&htim3);
    // start timer2 for IRED control
    HAL_TIM_Base_Start_IT(&htim2);


    oled_withDMA = 1;

    screenON = 1;

    i2c_ssd1306_init();//screen INIT
    i2c_ssd1306_pattern();//set any params for screen
    //i2c_ssd1306_invert();
    i2c_ssd1306_clear();//clear screen

