salara1960/stm32f401_project/Core/Src/main.c
	/*if (!uartRdy) {
		HAL_GPIO_WritePin(LED_ERROR_GPIO_Port, LED_ERROR_Pin, GPIO_PIN_SET);//ON err_led
		return 1;
	} else {
		HAL_GPIO_WritePin(LED_ERROR_GPIO_Port, LED_ERROR_Pin, GPIO_PIN_RESET);//OFF err_led
	}*/

#ifdef SET_STATIC_MEM
	char *buff = &PrnBuf[0];
	buff[0] = 0;
#else
	char *buff = (char *)calloc(1, len);
	if (buff) {
#endif
		if (addTime) {
			uint32_t ep;
			if (!setDate) ep = get_secCounter();
					 else ep = extDate;
			dl = sec_to_string(ep, buff);
		}
		if (tag) dl += sprintf(buff+strlen(buff), "[%s] ", tag);
		va_start(args, fmt);
		vsnprintf(buff + dl, len - dl, fmt, args);
		uartRdy = 0;
		//er = HAL_UART_Transmit(&huart1, (uint8_t *)buff, strlen(buff), 1000);
		if (HAL_UART_Transmit_DMA(&huart1, (uint8_t *)buff, strlen(buff)) != HAL_OK) devError |= devUART;
		/**/
		while (HAL_UART_GetState(&huart1) != HAL_UART_STATE_READY) {
			if (HAL_UART_GetState(&huart1) == HAL_UART_STATE_BUSY_RX) break;
			HAL_Delay(1);
		}
		/**/
		va_end(args);
#ifndef SET_STATIC_MEM
		free(buff);
	}
#endif

	return 0;
}
//------------------------------------------------------------------------------------------
void HAL_UART_TxCpltCallback(UART_HandleTypeDef *huart)
{
	if (huart->Instance == USART1) uartRdy = 1;
	else
	if (huart->Instance == USART6) dfpRdy = 1;
}
//------------------------------------------------------------------------------------------
void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart)
{
	if (huart->Instance == USART1) {
		RxBuf[rx_uk & 0xff] = (char)uRxByte;
		if (uRxByte == 0x0a) {//end of line
			char *uk = strstr(RxBuf, _extDate);//const char *_extDate = "epoch=";
			if (uk) {
				uk += strlen(_extDate);
				if (*uk != '?') {
					if (strlen(uk) < 10) setDate = false;
					else {
						char *uke = strchr(uk, ':');
						if (uke) {
							tZone = atoi(uke + 1);
							*uke = '\0';
						} else tZone = 0;
						extDate = atol(uk);
						set_Date((time_t)extDate);
					}
				} else setDate = true;
			} else if (strstr(RxBuf, _restart)) {//const char *_restart = "restart";
				if (!restart_flag) restart_flag = 1;
			}
			rx_uk = 0;
			memset(RxBuf, 0, sizeof(RxBuf));
		} else rx_uk++;

		HAL_UART_Receive_IT(huart, (uint8_t *)&uRxByte, 1);
	}
#ifdef SET_DFPLAYER
	else if (huart->Instance == USART6) {
		if (dfp_uRxByte == DFPLAYER_START_BYTE) dfp_Begin = true;
		if (dfp_Begin) {
			dfp_RxBuf[dfp_rx_uk & 0x3f] = dfp_uRxByte;
			dfp_rx_uk++;
		}
		if (dfp_uRxByte == DFPLAYER_END_BYTE) {//end of pack
			memcpy(dfp_ACK, dfp_RxBuf, dfp_rx_uk);
			dfp_ACK_len = dfp_rx_uk;
			dfp_rx_uk = 0;
			dfp_Begin = false;
			memset(dfp_RxBuf, 0, sizeof(dfp_RxBuf));
			putMsg(msg_dfpRX);
		}

		HAL_UART_Receive_IT(huart, (uint8_t *)&dfp_uRxByte, 1);
	}
#endif
#ifdef SET_BLE
	else if (huart->Instance == USART2) {
		if ((ble_uRxByte >= 0x0a) && (ble_uRxByte <= 0x7f)) {
			ble_RxBuf[ble_rx_uk++] = (char)ble_uRxByte;
			ble_rx_uk &= 0xff;
			char *uki = NULL;
			if ((uki = strstr(ble_RxBuf, "\r\r\n"))) {
				*uki = '\0';
				memset(BleBuf, 0, sizeof(BleBuf));
				strncpy(BleBuf, ble_RxBuf, strlen(ble_RxBuf));

				putMsg(msg_bleRx);

				ble_rx_uk = 0;
				memset(ble_RxBuf, 0, sizeof(ble_RxBuf));
			}
		}

		HAL_UART_Receive_IT(huart, (uint8_t *)&ble_uRxByte, 1);
	}
#endif

}
//-------------------------------------------------------------------------------------------
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{

	if (htim->Instance == TIM3) {//one call in _10ms

		HalfSecCounter++;//+10ms

		//if (!(HalfSecCounter % _500ms)) putMsg(msg_500ms);

		if (!(HalfSecCounter % _1s)) {//seconda
			secCounter++;
			//HalfSecCounter = 0;
			//HAL_GPIO_TogglePin(LED_GPIO_Port, LED_Pin);//set ON/OFF LED

			if (screenON) {
				HAL_GPIO_TogglePin(LED_GPIO_Port, LED_Pin);//set ON/OFF LED1
			} else {
				if (HAL_GPIO_ReadPin(LED_GPIO_Port, LED_Pin) == GPIO_PIN_SET)
					HAL_GPIO_WritePin(LED_GPIO_Port, LED_Pin, GPIO_PIN_RESET);
			}

			putMsg(msg_sec);
		}
	}
#ifdef SET_IRED
	else if (htim->Instance == TIM2) {
		uint8_t irdata = RECIV_PIN; // пин для приёма
		irparams.timer++;  // One more 50uS tick
		if (irparams.rawlen >= RAWBUF) irparams.rcvstate = STATE_OVERFLOW;  // Buffer overflow

		switch (irparams.rcvstate) {
			case STATE_IDLE: // In the middle of a gap
				if (irdata == MARK) {
					if (irparams.timer < GAP_TICKS) { // Not big enough to be a gap.
						irparams.timer = 0;
					} else {
						// Gap just ended; Record duration; Start recording transmission
						irparams.overflow = 0;
						irparams.rawlen  = 0;
						irparams.rawbuf[irparams.rawlen++] = irparams.timer;
						irparams.timer = 0;
						irparams.rcvstate = STATE_MARK;
					}
				}
			break;
			case STATE_MARK:  // Timing Mark
				if (irdata == SPACE) {// Mark ended; Record time
					irparams.rawbuf[irparams.rawlen++] = irparams.timer;
					irparams.timer = 0;
					irparams.rcvstate = STATE_SPACE;
				}
			break;
			case STATE_SPACE:  // Timing Space
				if (irdata == MARK) {// Space just ended; Record time
					irparams.rawbuf[irparams.rawlen++] = irparams.timer;
					irparams.timer = 0;
					irparams.rcvstate = STATE_MARK;
				} else if (irparams.timer > GAP_TICKS) {// Space
					irparams.rcvstate = STATE_STOP;
				}
			break;
			case STATE_STOP:  // Waiting; Measuring Gap
			 	if (irdata == MARK) irparams.timer = 0;  // Reset gap timer
			break;
			case STATE_OVERFLOW:  // Flag up a read overflow; Stop the State Machine
				irparams.overflow = 1;
				irparams.rcvstate = STATE_STOP;
			break;
		}
		//
	}
#endif

}
//-------------------------------------------------------------------------------------------
void HAL_SPI_TxCpltCallback(SPI_HandleTypeDef *hspi)
{
	if (hspi->Instance == SPI1) {//FLASH
		spi_cnt++;
		spiRdy = 1;
	}
}
//-------------------------------------------------------------------------------------------
void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin)
{

#ifdef SET_KBD
	if (GPIO_Pin == KBD_INT_Pin) {
		if (kbdEnable) {
			kbdCode = kbd_get_touch();
			if ((kbdCode >= 0x23) && (kbdCode <= 0x39)) {// '#'...'9'
				kbdCnt++;
				putMsg(msg_kbd);
			}
		}
	}
#endif

